IDENTIFICATION DIVISION.
PROGRAM-ID. CALC.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(10).
PROCEDURE DIVISION.
MAIN.
    DISPLAY "好きな整数を入力してください".
    ACCEPT A.
    COMPUTE A = A * 10
    DISPLAY "入力した整数の10倍は" A "です".
    STOP RUN.
