IDENTIFICATION DIVISION.
PROGRAM-ID. GREETING.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(3).
PROCEDURE DIVISION.
MAIN.
    DISPLAY "今は朝ですか、昼ですか？"
    DISPLAY "1 朝　2 昼"
    ACCEPT A
    IF A = 1 THEN
        DISPLAY "おはよう"
    END-IF
    IF A = 2 THEN
        DISPLAY "こんにちは"
    END-IF
    IF A NOT = 1 AND A NOT = 2 THEN
        DISPLAY "こんばんは・・・かな？"
    END-IF
    STOP RUN.
